{
  "Label : 0]": 32001,
  "[((]": 32018,
  "[))]": 32019,
  "[.../]": 32014,
  "[...]": 32015,
  "[../]": 32013,
  "[..]": 32016,
  "[/**/]": 32017,
  "[//]": 32011,
  "[://]": 32012,
  "[< / script >]": 32025,
  "[< script >]": 32024,
  "[<!]": 32022,
  "[</]": 32010,
  "[<?]": 32021,
  "[Attack Syntax :]": 32002,
  "[Attack Type :]": 32003,
  "[Cross - Site Scripting ( XSS )]": 32006,
  "[Label : 1]": 32000,
  "[Path Traversal]": 32007,
  "[Remote Code Execution ( RCE )]": 32008,
  "[SQL Injection]": 32005,
  "[XML External Entity ( XXE ) Injection]": 32009,
  "[\\..]": 32023,
  "[nan]": 32004,
  "[||]": 32020
}
