{
  "Label : 0]": 30001,
  "[((]": 30018,
  "[))]": 30019,
  "[.../]": 30014,
  "[...]": 30015,
  "[../]": 30013,
  "[..]": 30016,
  "[/**/]": 30017,
  "[//]": 30011,
  "[://]": 30012,
  "[< / script >]": 30025,
  "[< script >]": 30024,
  "[<!]": 30022,
  "[</]": 30010,
  "[<?]": 30021,
  "[Attack Syntax :]": 30002,
  "[Attack Type :]": 30003,
  "[Cross - Site Scripting ( XSS )]": 30006,
  "[Label : 1]": 30000,
  "[Path Traversal]": 30007,
  "[Remote Code Execution ( RCE )]": 30008,
  "[SQL Injection]": 30005,
  "[XML External Entity ( XXE ) Injection]": 30009,
  "[\\..]": 30023,
  "[nan]": 30004,
  "[||]": 30020
}
